In [44]:
import numpy as np
import pandas as pd

1. Convert the following into a Series of elements

In [45]:
l = [10,20,30,40,50]
d = {"a":10,"b":20,"c":30,"d":40,"e":50}

In [46]:
ls = pd.Series(l)
ls

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [47]:
ds = pd.Series(d)
ds

a    10
b    20
c    30
d    40
e    50
dtype: int64

2. Add the Following Series.

In [48]:
s1 = pd.Series({
    "India": 1,
    "Srilanka": 2,
    "Bangladesh": 3,
    "Russia": 4,
    "England": 5
})
s1

India         1
Srilanka      2
Bangladesh    3
Russia        4
England       5
dtype: int64

In [49]:
s2 = pd.Series({
    "India": 6,
    "Srilanka": 7,
    "Bangladesh": 8,
    "Russia": 9,
    "England": 10
})
s2

India          6
Srilanka       7
Bangladesh     8
Russia         9
England       10
dtype: int64

In [50]:
s1 + s2

India          7
Srilanka       9
Bangladesh    11
Russia        13
England       15
dtype: int64

3. Create dataframe of size 5,4 with Columns W to Z and Rows A to E. Use np.random() for generation the entries.

In [51]:
rng = np.random.default_rng()
df = pd.DataFrame(rng.random(5*4).reshape(5,4), 
                  index=list('abcde'.upper()), 
                  columns=list('wxyz'.upper()))

In [52]:
df

          W         X         Y         Z
A  0.268393  0.571951  0.942205  0.642518
B  0.021199  0.716083  0.113860  0.421057
C  0.805294  0.257247  0.778827  0.453594
D  0.837707  0.881094  0.580747  0.683472
E  0.754623  0.649475  0.802397  0.821253

4. Write the data frame to excel file.

In [53]:
# to write into excel, we need openpyxl module `pip3 install openpyxl`
df.to_excel("question3.xlsx", sheet_name="task-1")

5. a) Use the dataframe and Access any one column and any one row of the dataframe.

In [54]:
df.W

A    0.268393
B    0.021199
C    0.805294
D    0.837707
E    0.754623
Name: W, dtype: float64

In [55]:
df.loc['A']

W    0.268393
X    0.571951
Y    0.942205
Z    0.642518
Name: A, dtype: float64

5. b) Access data with index values of row A using loc and iloc

In [56]:
data = df.loc['A'] # returns a pd.Series whose index are 'W','X','Y','z'

In [57]:
data.loc['W']

0.2683925000822307

In [58]:
data.iloc[0]

0.2683925000822307

5. c) Print a subset of the data by selecting any two rows and columns using loc.

In [59]:
df.loc[['A','D'], ['X','Y']]

          X         Y
A  0.571951  0.942205
D  0.881094  0.580747

5. d) Drop the first row of the table.

In [60]:
df.drop('A', inplace=True)

In [61]:
df

          W         X         Y         Z
B  0.021199  0.716083  0.113860  0.421057
C  0.805294  0.257247  0.778827  0.453594
D  0.837707  0.881094  0.580747  0.683472
E  0.754623  0.649475  0.802397  0.821253